# Conditional Logic in SQL

## Introduction

Conditional logic in SQL allows analysts to apply business rules and dynamic decision-making within queries. It enables data transformation based on specific conditions, making results more meaningful and analysis-ready.

The most commonly used construct for conditional logic is the `CASE` statement, which evaluates conditions and returns values accordingly.

Conditional logic is widely used in data classification, segmentation, KPI calculation, and reporting workflows. It helps convert raw values into categorized or interpreted outputs required for business analysis.

This notebook focuses on practical use cases of conditional expressions in real-world analytical queries.

---

## Topics Covered

- `CASE WHEN` statements  
- Simple vs Searched CASE  
- Creating derived columns  
- Conditional aggregation  
- Business rule implementation in SQL  

---

### Database Connection

In [2]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:Bhavesh%402025@localhost/customers

### Basic CASE WHEN

### Example 1: Salary Category

In [4]:
%%sql 
select name,salary,
    CASE 
        WHEN salary > 80000 THEN 'High'
        WHEN salary >= 60000 THEN 'Medium'
        ELSE 'Low'
    END as salary_category
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 60000, 'Medium'),
 ('Neha', 45000, 'Low'),
 ('Rahul', 85000, 'High'),
 ('Priya', 50000, 'Low'),
 ('Suresh', 75000, 'Medium'),
 ('Anita', 55000, 'Low'),
 ('Vikram', 65000, 'Medium'),
 ('Rohit', 48000, 'Low')]

### Example 2: City Classification

In [7]:
%%sql 
select name, city ,
  CASE 
        WHEN city IN ('Mumbai','Delhi') THEN 'metro'
        ELSE 'non_metro'
    END as city_type
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 'Mumbai', 'metro'),
 ('Neha', 'Pune', 'non_metro'),
 ('Rahul', 'Bangalore', 'non_metro'),
 ('Priya', 'Delhi', 'metro'),
 ('Suresh', 'Hyderabad', 'non_metro'),
 ('Anita', 'Mumbai', 'metro'),
 ('Vikram', 'Chennai', 'non_metro'),
 ('Rohit', 'Delhi', 'metro')]

### Example 3: Experience Level (Based on Joining Date)

In [11]:
%%sql 
select name,joining_date,
    CASE 
        WHEN YEAR(joining_date) <= 2020 THEN 'senior'
        ElSE 'Junior'
END as experience_level
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', datetime.date(2022, 1, 15), 'Junior'),
 ('Neha', datetime.date(2021, 7, 10), 'Junior'),
 ('Rahul', datetime.date(2020, 3, 20), 'senior'),
 ('Priya', datetime.date(2022, 11, 1), 'Junior'),
 ('Suresh', datetime.date(2019, 6, 18), 'senior'),
 ('Anita', datetime.date(2021, 2, 25), 'Junior'),
 ('Vikram', datetime.date(2020, 9, 12), 'senior'),
 ('Rohit', datetime.date(2023, 2, 5), 'Junior')]

### CASE in WHERE Clause

### Example 4: Filter Only High Salary Employees

In [17]:
%%sql 
select * 
from employees 
where 
    CASE 
        WHEN salary >= 80000 THEN 1 
        ElSE 0 
    END=1;

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[(3, 'Rahul', 'IT', 'Data Scientist', 85000, datetime.date(2020, 3, 20), 'Bangalore')]

### Conditional Aggregation

### Example 5: Count Employees in Each Salary Category

In [21]:
%%sql 
select 
 SUM(CASE WHEN salary >= 80000 THEN 1 ELSE 0 END) as high_salary_count,
 SUM(CASE WHEN salary BETWEEN 60000 AND 79999 THEN 1 ELSE 0 END) as medium_salary_count,
 SUM(CASE WHEN salary < 60000 THEN 1 ELSE 0 END) as low_salary_count 
from employees

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[(Decimal('1'), Decimal('3'), Decimal('4'))]

### Example 6: Department-wise High Salary Count

In [26]:
%%sql
select department, 
 SUM(CASE WHEN salary >= 80000 THEN 1 ELSE 0 END) as high_salary_count
from employees 
group by department

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('IT', Decimal('1')),
 ('HR', Decimal('0')),
 ('Finance', Decimal('0')),
 ('Marketing', Decimal('0')),
 ('Sales', Decimal('0'))]

### Example 7: Total Bonus by Salary Category

In [30]:
%%sql 
select
     CASE 
        WHEN e.salary > 80000 THEN 'High'
        WHEN e.salary >= 60000 THEN 'Medium'
        ELSE 'Low'
    END as salary_category,
    SUM(coalesce(s.bonus,0)) as total_bonus 
from employees e 
Left join 
salaries s 
on e.employee_id = s.employee_id
group by salary_category

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Medium', Decimal('19000')),
 ('Low', Decimal('4000')),
 ('High', Decimal('12000'))]

### CASE with GROUP BY

### Example 8: Metro vs Non-Metro Employee Count

In [32]:
%%sql 
select 
  CASE 
        WHEN city IN ('Mumbai','Delhi') THEN 'metro'
        ELSE 'non_metro'
    END as city_type,
count(*) as total_employee
from employees
group by city_type

 * mysql+pymysql://root:***@localhost/customers
2 rows affected.

[('metro', 4), ('non_metro', 4)]

### Advanced Business Logic

### Example 9: Performance Flag

In [33]:
%%sql 
select name,salary,
CASE 
    WHEN salary > 80000 then 'Top_performance'
    WHEN salary > 60000 then 'Good Performance'
    ELSE 'Need Improvement' 
 END as Prrformance_flag 
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 60000, 'Need Improvement'),
 ('Neha', 45000, 'Need Improvement'),
 ('Rahul', 85000, 'Top_performance'),
 ('Priya', 50000, 'Need Improvement'),
 ('Suresh', 75000, 'Good Performance'),
 ('Anita', 55000, 'Need Improvement'),
 ('Vikram', 65000, 'Good Performance'),
 ('Rohit', 48000, 'Need Improvement')]

### Example 10: Bonus Eligibility

In [36]:
%%sql 
select name,salary,
CASE 
    WHEN salary > 60000 THEN 'eligible'
    ELSE 'not_eligible'
    END as bonus_eligiblity
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 60000, 'not_eligible'),
 ('Neha', 45000, 'not_eligible'),
 ('Rahul', 85000, 'eligible'),
 ('Priya', 50000, 'not_eligible'),
 ('Suresh', 75000, 'eligible'),
 ('Anita', 55000, 'not_eligible'),
 ('Vikram', 65000, 'eligible'),
 ('Rohit', 48000, 'not_eligible')]

### Example 11: Combined Salary + Bonus Classification

In [39]:
%%sql 
select e.name,e.salary+coalesce(s.bonus,0)as total_com,
CASE 
    WHEN e.salary+coalesce(s.bonus,0) > 90000 THEN 'Premium'
    WHEN e.salary+coalesce(s.bonus,0) > 70000 THEN 'Standard'
    ELSE 'Basic'  
END  as compansection_level 
from employees e 
left join salaries s 
on e.employee_id = s.employee_id

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 65000, 'Basic'),
 ('Neha', 45000, 'Basic'),
 ('Rahul', 97000, 'Premium'),
 ('Priya', 50000, 'Basic'),
 ('Suresh', 83000, 'Standard'),
 ('Anita', 59000, 'Basic'),
 ('Vikram', 71000, 'Standard'),
 ('Rohit', 48000, 'Basic')]

### CASE Inside ORDER BY

### Example 12: Custom Sorting (High → Medium → Low)

In [40]:
%%sql 
SELECT name, salary
FROM employees
ORDER BY
    CASE
        WHEN salary >= 80000 THEN 1
        WHEN salary >= 60000 THEN 2
        ELSE 3
    END;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Rahul', 85000),
 ('Amit', 60000),
 ('Suresh', 75000),
 ('Vikram', 65000),
 ('Neha', 45000),
 ('Priya', 50000),
 ('Anita', 55000),
 ('Rohit', 48000)]

### Example 13: Detailed Category

In [41]:
%%sql 
select name, 
    CASE WHEN department='IT' THEN 
        CASE 
            WHEN salary >80000 THEN 'IT_high'
            ELSE 'IT_other'
            END 
        ELSE 'Non_it'
        END as dept_salary_category
from employees

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 'IT_other'),
 ('Neha', 'Non_it'),
 ('Rahul', 'IT_high'),
 ('Priya', 'Non_it'),
 ('Suresh', 'IT_other'),
 ('Anita', 'Non_it'),
 ('Vikram', 'Non_it'),
 ('Rohit', 'Non_it')]

In [44]:
%%sql 
    select 
    department,
    SUM(CASE WHEN salary >= 80000 THEN salary ELSE 0 END) AS high_salary_total,
    SUM(CASE WHEN salary < 80000 THEN salary ELSE 0 END) AS other_salary_total
from  employees
group by department;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('IT', Decimal('85000'), Decimal('135000')),
 ('HR', Decimal('0'), Decimal('45000')),
 ('Finance', Decimal('0'), Decimal('115000')),
 ('Marketing', Decimal('0'), Decimal('55000')),
 ('Sales', Decimal('0'), Decimal('48000'))]

### Detailed Salary Bands

In [47]:
%%sql
Select
name, salary,
       CASE
           WHEN salary >= 90000 THEN 'Executive'
           WHEN salary >= 75000 THEN 'Senior'
           WHEN salary >= 60000 THEN 'Mid-Level'
           WHEN salary >= 45000 THEN 'Junior'
           ELSE 'Entry-Level'
       END AS salary_band
FROM employees;

 * mysql+pymysql://root:***@localhost/customers
8 rows affected.

[('Amit', 60000, 'Mid-Level'),
 ('Neha', 45000, 'Junior'),
 ('Rahul', 85000, 'Senior'),
 ('Priya', 50000, 'Junior'),
 ('Suresh', 75000, 'Senior'),
 ('Anita', 55000, 'Junior'),
 ('Vikram', 65000, 'Mid-Level'),
 ('Rohit', 48000, 'Junior')]